app/Controllers/ConsultasClientesController.php

    public function verSolicitudes()
    {
        $modelo = new ConsultasClientesModel();
        $consultas = $modelo->orderBy('hora_creada', 'DESC')->findAll();
---
SELECT *
FROM `consultasclientes`
ORDER BY `hora_creada` DESC