app/Controllers/Home.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index()
    {
        $productos = $this->productoModel->where('activo', 1)->findAll();