app/Controllers/PerfilController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '11'
SELECT *
FROM `factura`
WHERE `id_usuario` = '11'
ORDER BY `fecha_creacion` DESC
SELECT *
FROM `consultasclientes`
WHERE `id_usuario` = '11'
ORDER BY `hora_creada` DESC
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $usuarioModel = new UsuarioModel();
        $facturaModel = new FacturaModel();
        $consultasModel = new ConsultasClientesModel();

        $idUsuario = session()->get('id_usuario');

        //Obtener datos del usuario
        $usuario = $usuarioModel->find($idUsuario);

        //Obtener órdenes del usuario
        $ordenes = $facturaModel->where('id_usuario', $idUsuario)
            ->orderBy('fecha_creacion', 'DESC')
            ->findAll();

        //Obtener consultas del usuario
        $consultas = $consultasModel->where('id_usuario', $idUsuario)
            ->orderBy('hora_creada', 'DESC')
            ->findAll();