app/Controllers/ProductosController.php

    public function ver($id)
    {
        $producto = $this->productoModel->find($id);

        if (!$producto) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Producto no encontrado");
        }

        $talles = $this->talleModel->where('id_producto', $id)->findAll();
---
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '34'