app/Controllers/UsuarioController.php

    public function loginPost()
    {
        $session = session();
        $model = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuario = $model->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'admin@pluto.com'
 LIMIT 1

    public function registroPost()
    {
        helper(['form']);
        $model = new UsuarioModel();

        $nombre     = $this->request->getPost('nombre');
        $apellido   = $this->request->getPost('apellido');
        $email      = $this->request->getPost('email');
        $password   = $this->request->getPost('password');
        $password2  = $this->request->getPost('password_confirm');

        if ($password !== $password2) {
            return redirect()->back()->withInput()->with('error', 'Las contraseñas no coinciden.');
        }

        if ($model->where('email', $email)->first()) {
            return redirect()->back()->withInput()->with('error', 'Ingresaste un correo ya registrado.');
        }

        $data = [
            'nombre'     => $nombre,
            'apellido'   => $apellido,
            'email'      => $email,
            'contraseña' => password_hash($password, PASSWORD_DEFAULT),
            'id_rol'     => 2,
            'activo'     => 1
        ];

        $model->insert($data);
---
SELECT *
FROM `usuarios`
WHERE `email` = 'prueba21@gmail.com'
 LIMIT 1
INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `contraseña`, `id_rol`, `activo`) VALUES ('prueba', 'prueba', 'prueba21@gmail.com', '$2y$10$HkksHHSCC/uK44ZzUUqoSOg6L9YAX3yIQDXRaFuUtZEPd7lJMBxKa', 2, 1)

    public function usuarios()
    {
        $modelo = new UsuarioModel();
        $todos = $modelo->findAll();
---
SELECT *
FROM `usuarios`

    public function desactivar($id)
    {
        $modelo = new UsuarioModel();
        $usuario = $modelo->find($id);

        if (!$usuario) {
            return redirect()->to('/admin/usuarios')->with('error', 'Usuario no encontrado.');
        }

        //Si es admin, verificar que no sea el último activo
        if ($usuario['id_rol'] == 1 && $usuario['activo']) {
            $adminsActivos = $modelo->where('id_rol', 1)->where('activo', 1)->countAllResults();

            if ($adminsActivos <= 1) {
                return redirect()->to('/admin/usuarios')->with('error', 'No se puede desactivar al único administrador activo.');
            }
        }

        $modelo->update($id, ['activo' => 0]);
---
UPDATE `usuarios` SET `activo` = 0
WHERE `usuarios`.`id_usuario` IN ('13')